---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.StructuralAssetFailures
source: html/86ef4db8-59bf-f148-c5e5-c307a7600ce8.htm
---
# BuiltInFailures.StructuralAssetFailures Properties

Material assigned to the Analytical Element does not contain Structure parameters - verify material content.